<a href="https://colab.research.google.com/github/sabsabb/Python-Pandas/blob/main/Pandas_06.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Mengganti Nama / Label Kolom pada Data Frame**

Import Modules

In [1]:
import pandas as pd
import numpy as np

Persiapan Data Frame

In [2]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,10,size=(n_rows,n_cols)), columns=cols)
df

   A  B  C  D  E
0  1  1  1  7  7
1  3  9  2  1  5
2  6  1  1  5  9
3  1  1  9  4  3
4  1  7  2  4  9

Mengganti Nama/Label Kolom

In [4]:
df.rename(columns={'C':'Hobi'})

   A  B  Hobi  D  E
0  1  1     1  7  7
1  3  9     2  1  5
2  6  1     1  5  9
3  1  1     9  4  3
4  1  7     2  4  9

Mengganti Nama/Label Beberapa Kolom Sekaligus

In [5]:
df.rename(columns={'A':'Nama','B':'Nim','C':'Kom'})

   Nama  Nim  Kom  D  E
0     1    1    1  7  7
1     3    9    2  1  5
2     6    1    1  5  9
3     1    1    9  4  3
4     1    7    2  4  9